app/views/microposts/_form.html.erb

SELECT "users".* FROM "users"
---
<%= f.label :user_id %><br>
<%= f.select :user_id, options_for_select(User.all.map{| user | [user.name, user.id]} )%>