app/controllers/users_controller.rb

  def show
  @microposts = Micropost.all
---
SELECT "microposts".* FROM "microposts"